# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Admin\Desktop\IR LCD\IR_LCD\IR_LCD.cydsn\IR_LCD.cyprj
# Date: Fri, 18 Nov 2016 22:46:44 GMT
#set_units -time ns
create_clock -name {CyHFCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/hfclk}] -edges {1 6001 12001} [list [get_pins {ClockBlock/udb_div_0}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CySYSCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyRouted1} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dsi_in_0}]]


# Component constraints for C:\Users\Admin\Desktop\IR LCD\IR_LCD\IR_LCD.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Admin\Desktop\IR LCD\IR_LCD\IR_LCD.cydsn\IR_LCD.cyprj
# Date: Fri, 18 Nov 2016 22:46:38 GMT
